#+title: PATA Server
#+author: Hrushikesh Patwardhan

* Dependencies
This server is written in Common Lisp (SBCL). It depends on the
following libraries:
+ ~hunchentoot~ A simple http server
+ ~ironclad~ An encryption library used to hash the passwords
+ ~flexi-streams~ A library to make handling SHA256 digests easy
+ ~cl-csv~ To read from and write to csv files
+ ~cl-json~ To convert Lisp objects into json format to send it to the
  app

The ~quicklisp~ package management system is used to load these
libraries

#+begin_src lisp
(ql:quickload :hunchentoot)
(ql:quickload "ironclad")
(ql:quickload :flexi-streams)
(ql:quickload :cl-csv)
(ql:quickload :cl-json)
#+end_src

#+RESULTS:
| :CL-JSON |

